
const List<Map<String, dynamic>> productsData = [
  {
    'id': 1,
    'name': 'Процессор AMD RYZEN 5 7600X BOX (100-100000593WOF)',
    'images': ['https://avatars.mds.yandex.net/get-mpic/1865219/img_id695518003019349006.jpeg/optimize', 'https://avatars.mds.yandex.net/get-mpic/5334770/img_id6513214735362286648.jpeg/optimize', 'https://avatars.mds.yandex.net/get-mpic/5250150/img_id1851849954872164267.png/optimize'],
    'price': 32396.0,
    'sale_price': 23524.0,
    'description': 'Процессор AMD Ryzen 5 7600X – это мощное решение для игровых систем и рабочих станций. В основе модели используются высококачественные компоненты и передовые технологии, что в связке с большим числом физических ядер и виртуальных потоков может обеспечить непревзойденно высокую вычислительную мощность в любых сценариях использования компьютера. Поддерживаемые AMD Ryzen 5 7600X частоты могут варьироваться от 4.7 до 5.3 ГГц. Благодаря этому, а также свободному множителю данная модель отличается высоким уровнем быстродействия и большим потенциалом для его дальнейшего развития. Объем поддерживаемой временной памяти может достигать 128 ГБ. Также вычислительный модуль поддерживает работу с интерфейсом PCI-E 5 поколения, что открывает широкие возможности для создания бескомпромиссной компьютерной системы для работы и развлечений. Помимо высокой производительности процессор также отличается тепловыделением, которое не превышает 105 Вт. Для охлаждения могут использоваться как воздушные, так и водяные системы. Установка на материнскую плату производится при помощи сокета AM5.'
  },
  {
    'id': 2,
    'name': 'SSD диск Msi 2.5" 480Гб SATA (S78-440E350-P83)',
    'images': ['https://avatars.mds.yandex.net/get-mpic/10683269/2a0000018a2a2c3e0a7c0ce717ad72f042fd/optimize', 'https://avatars.mds.yandex.net/get-mpic/11562667/2a0000018f560c3ae515d6fd2cd230cd1924/optimize', 'https://avatars.mds.yandex.net/get-mpic/12525304/2a0000018f560c3ae71ac3d6df7a01370891/optimize'],
    'price': 4280.0,
    'sale_price': 3326.0,
    'description': 'Ускорь свой компьютер с твердотельным накопителем MSI 480GB SATA 2.5” SPATIUM S270! Хватит терпеть медленную загрузку системы и долгие ожидания – пришло время обновить свой ПК с помощью высококлассного твердотельного накопителя MSI 480GB SATA 2.5” SPATIUM S270. Этот накопитель обеспечит невероятную скорость работы и улучшит производительность твоей системы до невиданных ранее высот. Основные преимущества SSD MSI 480GB SATA 2.5” SPATIUM S270 Быстродействие на новом уровне: Забудь о долгих ожиданиях загрузки ОС и приложений. Скорость чтения и записи на уровне молнии сделает работу с компьютером удовольствием. Объем для всех данных: С ёмкостью 480GB ты получишь достаточно места для хранения операционной системы, приложений, игр, фотографий, видео и других файлов. Надежность и долговечность: Твердотельные накопители известны своей стабильностью и устойчивостью к механическим воздействиям, что значительно увеличивает срок их службы. Простая установка: Стандартный форм-фактор 2.5” делает установку твердотельного накопителя MSI SPATIUM S270 легкой и быстрой процедурой. Энергоэффективность: Сниженное энергопотребление означает, что твой компьютер будет работать дольше от одной зарядки или батареи. Модернизация в один момент: Замена медленного жесткого диска на SSD – это один из самых эффективных способов улучшить производительность старого компьютера. Играй без ограничений, работай без задержек, запускай приложения мгновенно – все это возможно с твердотельным накопителем MSI 480GB SATA 2.5” SPATIUM S270. Обнови свой компьютер уже сегодня и почувствуй разницу! Не упусти шанс улучшить свой опыт работы с компьютером. Закажи твердотельный накопитель MSI SPATIUM S270 прямо сейчас и наслаждайся безупречной производительностью каждый день!'
  },
  {
    'id': 3,
    'name': 'Xiaomi Смартфон POCO M6 6/128 ГБ, серебряный',
    'images': ['https://avatars.mds.yandex.net/get-mpic/1522540/2a00000190bd89b348940350e1b422c9e5a9/optimize', 'https://avatars.mds.yandex.net/get-mpic/4303516/2a00000190c56ae90e3e0fd2cbf8699f6b86/optimize', 'https://avatars.mds.yandex.net/get-mpic/1808939/2a00000190bd89b2665f0a468f96645e3018/optimize'],
    'price': 19990.0,
    'sale_price': 10043.0,
    'description': 'Смартфон Xiaomi POCO M6 6/128 ГБ – стильный и функциональный гаджет, который станет незаменимым помощником в повседневной жизни. Смартфон оснащен 6 ГБ оперативной памяти и 128 ГБ встроенной памяти, что позволяет хранить большое количество данных и приложений. Смартфон имеет 6,5-дюймовый экран с соотношением сторон 5:3 и разрешением Full HD (2460x1080 пикселей). Экран выполнен на IPS-матрице и имеет частоту обновления 90 Гц, что обеспечивает плавное и быстрое отображение информации. Xiaomi POCO M6 оснащен двумя основными камерами: широкоугольной и макро. Разрешение основной камеры составляет 108 МП, а фронтальной – 13 МП. Благодаря автофокусировке и тыловой вспышке, вы сможете делать качественные снимки в любых условиях освещения. Смартфон поддерживает стандарты связи 2G, 3G, 4G LTE, Wi-Fi 802.11ac и Bluetooth 5.0. Смартфон имеет степень защиты IP53, что обеспечивает защиту от пыли и брызг. Корпус устройства выполнен из стекла и пластика, что придает ему стильный и современный вид. Смартфон поддерживает быструю зарядку Xiaomi HyperCharge и реверсивную зарядку, что позволяет заряжать его от других устройств. Емкость аккумулятора составляет 4500 мА⋅ч, что обеспечивает длительное время работы без подзарядки. В комплект поставки входит смартфон, адаптер питания, кабель USB Type-C, SIM-инжектор, чехол и документация.'
  },
  {
    'id': 4,
    'name': 'Ноутбук ASUS TUF 15.6" 1920x1080 FHD 144Hz IPS (Intel Core i7-12700H, 16GB RAM DDR4, 1TB SSD, NVIDIA GeForce RTX 4070, Windows 11 Home) FX507ZI',
    'images': ['https://avatars.mds.yandex.net/get-mpic/1526692/2a0000018ccfb55822f63f3fb444d9e7b01f/optimize', 'https://avatars.mds.yandex.net/get-mpic/12222014/2a0000018ccfb55822d998cbd06d8781e228/optimize', 'https://avatars.mds.yandex.net/get-mpic/12222123/2a0000018ccfb5581b1b38541be066cb5290/optimize'],
    'price': 228900.0,
    'sale_price': 161913.0,
    'description': 'Ноутбук ASUS TUF 15.6" 1920x1080 FHD 144Hz IPS - это мощный и надежный инструмент для работы и развлечений. ASUS TUF оснащен процессором Intel Core i7-12700H, который обеспечивает высокую производительность и быстродействие. С 16GB оперативной памяти DDR4 вы сможете одновременно запускать множество приложений и игр без задержек и зависаний. 1TB SSD-накопитель обеспечивает быстрый доступ к данным и позволяет хранить большое количество файлов и документов. Ноутбук оснащен видеокартой NVIDIA GeForce RTX 4070, которая обеспечивает высокое качество графики и плавность изображения в играх и при работе с графическими приложениями. ASUS TUF работает на операционной системе Windows 11 Home, которая предлагает множество новых функций и улучшений по сравнению с предыдущей версией. 15.6-дюймовый экран с разрешением 1920x1080 пикселей и частотой обновления 144 Гц обеспечивает яркое и четкое изображение, а технология IPS гарантирует широкие углы обзора и реалистичные цвета. В целом, ноутбук ASUS TUF 15.6" 1920x1080 FHD 144Hz IPS станет отличным выбором для тех, кто ищет мощный и надежный инструмент для работы, учебы и развлечений.'
  },
  {
    'id': 5,
    'name': 'Наушники беспроводные Hoco W35 bluetooth для телефона айфон, samsung galaxy, readmi pro 2, 3, белый / блютуз наушник для iphone, самсунг безпроводные',
    'images': ['https://avatars.mds.yandex.net/get-mpic/5319505/2a0000018a653d7b3773bf092f7062eab79b/optimize', 'https://avatars.mds.yandex.net/get-mpic/4565245/img_id386655107224699119.jpeg/optimize', 'https://avatars.mds.yandex.net/get-mpic/11764182/2a0000018b061ae2b769fe900ef384da73e8/optimize'],
    'price': 1149.0,
    'sale_price': 705.0,
    'description': 'Стильная и удобная Bluetooth-гарнитура оригинального дизайна с поддержкой SD-карт и аудио-кабелем в комплекте. Встроенный микрофон обеспечивает качественную передачу звука. Регулировка наушников по размеру головы, а также поворачивающиеся наушники позволят носить гарнитуру с максимальным удобством. Слот для карты памяти стандарта Micro-SD превращает наушники в MP3-плеер - слушайте музыку, не подключаясь к смартфону или ноутбуку. Клавиши управления на наушниках позволят ответить на звонок либо переключить композицию, а также отрегулировать громкость, не доставая телефон из сумки.Благодаря радиусу действия в 10 м вы можете общаться по телефону или слушать музыку, свободно перемещаясь по комнате.Если у вашей гарнитуры сел аккумулятор - просто подключите к ней аудиокабель (входит в комплект поставки) и продолжайте слушать музыку, либо зарядите гарнитуру от USB-порта. Время работы аккумулятора - до 40 часов.Время работы в режиме ожидания - до 200 часов.Время зарядки - 2 часа.'
  },
  {
    'id': 6,
    'name': 'PlayStation 5 Slim, с дисководом',
    'images': ['https://avatars.mds.yandex.net/get-mpic/4937511/2a0000018e2e318f9f68345a7ff1d9cf778b/optimize', 'https://avatars.mds.yandex.net/get-mpic/12591611/img_id3516548970752271735.png/optimize'],
    'price': 65990.0,
    'sale_price': 48312.0,
    'description': 'Представляем вашему вниманию игровую приставку PlayStation 5 Slim от Sony. Это обновленная версия популярной консоли, которая отличается улучшенными характеристиками и возможностями. PlayStation 5 Slim оснащена мощным центральным процессором AMD Ryzen Zen 2 с тактовой частотой 3,5 ГГц и графическим процессором AMD RDNA 2 с производительностью 10,3 Тфлопс. Это обеспечивает быструю и плавную работу, а также поддержку трассировки лучей, что делает графику еще более реалистичной. Объем оперативной памяти составляет 16 ГБ GDDR6 с пропускной способностью 448 Гбит/с, что обеспечивает быструю загрузку игр и приложений. Встроенное хранилище SSD объемом 825 ГБ позволяет хранить большое количество игр и медиафайлов. Приставка поддерживает 8K-расширения, технологию объемного 3D-звука Tempest 3D AudioTech, а также технологию трассировки лучей. Беспроводной геймпад с адаптивными курками и встроенным микрофоном обеспечивает максимальный комфорт во время игры. PlayStation 5 Slim имеет интерфейсы Wi-Fi IEEE 802.11ax, Gigabit Ethernet, USB Type-A 3.1, USB 3.1 Type-C, USB 2.0 Type-A, HDMI 2.1 и многое другое. Это позволяет подключать различные устройства и аксессуары, а также обеспечивает многофункциональность игровой консоли. В комплекте с приставкой идет беспроводной геймпад, подставка для консоли и второй геймпад. Выбирая PlayStation 5 Slim, вы получаете мощную, надежную и функциональную игровую консоль, которая обеспечит вам множество часов увлекательного геймплея.'
  },
  {
    'id': 7,
    'name': 'Телевизор Xiaomi TV A 55" 2025,4K UHD Smart TV, черный',
    'images': [],
    'price': 6999.0,
    'sale_price': 2175.0,
    'description': 'Мини проектор портативный: наслаждайтесь просмотром фильмов в любом месте. Портативность и мобильность. Мини проектор портативный - это компактное и легкое устройство, которое легко помещается в сумку или рюкзак. Благодаря своим размерам и весу, вы сможете взять его с собой в путешествие, на пикник или на вечеринку с друзьями. Проектор для фильмов Этот проектор отлично подходит для просмотра фильмов, сериалов и других мультимедийных материалов. Вы сможете наслаждаться качественным изображением на большом экране, не тратя много времени и средств на установку оборудования. Использование мини проектора портативного позволит вам наслаждаться любимыми фильмами в любое время и в любом месте. Благодаря компактности и легкости устройства, вы сможете брать его с собой в путешествия, на пикники или вечеринки с друзьями. Выбирая мини проектор портативный, вы получаете возможность наслаждаться просмотром фильмов и других мультимедийных материалов в любом месте и в любое время. Благодаря компактности и легкости устройства, вы сможете брать его с собой в путешествия, на пикники или вечеринки с друзьями.'
  },
  {
    'id': 8,
    'name': 'ТВ-приставка Xiaomi TV Box S 2nd Gen Global',
    'images': ['https://avatars.mds.yandex.net/get-mpic/11919271/2a0000018d1b45145d361e8348d2410bf60c/optimize', 'https://avatars.mds.yandex.net/get-mpic/12498212/2a0000018d1b45146656400a6745349ff017/optimize', 'https://avatars.mds.yandex.net/get-mpic/1592982/img_id4754634393025656341.jpeg/optimize'],
    'price': 8990.0,
    'sale_price': 3804.0,
    'description': 'В Xiaomi TV Box S 2nd Gen реализованы передовые технологии, позволяющие ему выводить качество изображения и звука на совершенно новый уровень. Возможности ограничиваются только параметрами телевизора, к которому подключено устройство. Удивительно высокая детализация и яркая картинка 4K Ultra HD, 3 840 х 2 160 пикселей, раскрывают каждый отображаемый элемент, обеспечивая пользователю полное погружение в происходящее на экране. С помощью реализованных технологий Dolby Vision и HDR10+ достигаются не только великолепная насыщенность, красочность и контрастность изображения, но и более широкий динамический диапазон, соответствующий стандартам киноиндустрии.'
  },
  {
    'id': 9,
    'name': 'Беспроводное зарядное устройство Xiaomi Mi 20W Wireless Charging Stand, черный',
    'images': ['https://avatars.mds.yandex.net/get-mpic/7179065/img_id283209431857677128.jpeg/optimize', 'https://avatars.mds.yandex.net/get-mpic/1884605/img_id7339465123675627585.jpeg/optimize', 'https://avatars.mds.yandex.net/get-mpic/4615588/img_id1210941854124566448.png/optimize'],
    'price': 2390.0,
    'sale_price': 1321.0,
    'description': 'Устройства с поддержкой протокола беспроводной зарядки EPP можно заряжать мощностью до 10 Вт, а с использованием официального зарядного устройства Xiaomi для Mi 9 мощностью 27 Вт максимальная мощность беспроводной зарядки может достигать 20 Вт.'
  },
  {
    'id': 10,
    'name': 'Смартфон Apple iPhone 12 256 ГБ, nano SIM+eSIM, белый',
    'images': ['https://avatars.mds.yandex.net/get-mpic/5346238/2a00000191388a00867e51a2ee3289b8a1f0/optimize', 'https://avatars.mds.yandex.net/get-mpic/12374158/2a0000018d8d2d309662ed0532c1f41cb450/optimize', 'https://avatars.mds.yandex.net/get-mpic/12222014/2a0000018d8d2d30965349067cacfb47b4a7/optimize'],
    'price': 96770.0,
    'sale_price': 51128.0,
    'description': 'Apple iPhone 12 — ультрамощный смартфон от престижного бренда. Девайс получил молниеносный процессор A14 Bionic и впечатляющий дисплей Super Retina XDR от края до края. Набор продвинутых камер эффективно работает даже в условиях слабого освещения. Видеоролики Dolby Vision завораживают реалистичностью. Фотовозможности гаджета колоссальны. Широкоугольный датчик теперь улавливает значительно больше света. Проработка нюансов очень точная днем и ночью. Портретный режим обеспечивает художественное размытие фона, выделяя самое главное. Смартфон объединяет прорывные возможности с легендарным дизайном. Apple iPhone 12 это выбор активного пользователя.'
  },
];